Add Mermaid diagrams, fix hashtags in docs
